{"data":{"post":{"id":"26a09104-5164-5019-8e65-b82bc10ba734","html":"<p>It has been a while since I started writing code it has been not that long actually since I realised how slow and unprodu tive I can be in comparison to my colleagues. Im not saying that I am bad at code or the fact that I am just generally slow (This is imposter syndrome territory, I hope). All I am saying that some of the tasks that I was doing took way too much time and when just a manual task of disabling the .env file, running the tests and renabling the file was way too cumbersome for my liking.</p>\n<p>These are few tips, that I have found from my colleagues at work, online and tutorials that I followed along the way, to make myself a slightly faster. The things below did not help me solve the issues I have encountered, but just merely dealt with the simple and annoying tasks of everyday. </p>\n<h2>Alias everything</h2>\n<h3>Create alerts for long tasks</h3>\n<h2>Automate Everything</h2>\n<h2>Write recipes for your IDE</h2>\n<h2>Bookmark your goto documentation</h2>\n<h2>Clean up your workspaces</h2>","fields":{"slug":"/things-that-helped-me-speed-up-my-coding/","prefix":"2019-09-19"},"frontmatter":{"title":"Things that helped me to speed up my coding","author":"Grace Zarczynska","category":"productivity","cover":{"childImageSharp":{"resize":{"src":"/static/69657d5d9f9e2a2aa0aa1c3e268ce4a1/c8002/photo-1490474418585-ba9bad8fd0ea.jpg"}}}}},"authornote":{"id":"84d990eb-4392-5ad3-9be7-3c4f061b5915","html":"<p><strong>Mr. Gatsby</strong> Proin ornare ligula eu tellus tempus elementum. Aenean <a href=\"/\">bibendum</a> iaculis mi, nec blandit lacus interdum vitae. Vestibulum non nibh risus, a scelerisque purus. Blandit lacus interdum vitae. Vestibulum non nibh risus, a scelerisque purus.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/things-that-helped-me-speed-up-my-coding/","prev":{"id":"64b70d38-9042-573e-8dd7-51c56cf959ba","fields":{"slug":"/like-nonsense/","prefix":"2017-10-21","source":"posts"},"frontmatter":{"title":"I like nonsense, it wakes up the brain cells","category":"testimonies"}},"source":"posts"}}